# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Categories..::..Size Property
Categories Class See Also
---
The total number of top-level categories in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override int Size { get; }
```

Visual Basic
---
```text
Public Overrides ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
virtual property int Size {
	int get () override;
}
```

# See Also
Categories Class
Autodesk.Revit.DB Namespace